#### Import relevant libraries

In [1]:
import numpy as np
import pandas as pd

#### Load dataset

In [2]:
marketing_data = pd.read_csv("data/marketing_campaign.csv")

#### Subset for relevant columns

In [3]:
marketing_data = marketing_data[['ID', 'Year_Birth','Marital_Status','Income']]

#### Inspect first 5 rows and data types of the dataset

In [4]:
marketing_data.head()

     ID  Year_Birth Marital_Status   Income
0  5524        1957         Single  58138.0
1  2174        1954         Single  46344.0
2  4141        1965       Together  71613.0
3  6182        1984       Together  26646.0
4  5324        1981        Married  58293.0

In [5]:
marketing_data.shape

(2240, 4)

#### Fill NAs in the income column

In [6]:
marketing_data['Income'] = marketing_data['Income'].fillna(0)

#### Change the data type of the Income from float to int

In [7]:
marketing_data['Income_changed'] = marketing_data['Income'].astype(int)

In [8]:
marketing_data[['Income','Income_changed']].head()

    Income  Income_changed
0  58138.0           58138
1  46344.0           46344
2  71613.0           71613
3  26646.0           26646
4  58293.0           58293

In [9]:
marketing_data[['Income','Income_changed']].dtypes

Income            float64
Income_changed      int32
dtype: object